solokeys/solo1/nrf52840/main.c
#define USBD_CONFIG_DESCRIPTOR_SIZE   9
#define USBD_CONFIG_DESCRIPTOR_FULL_SIZE   (9 + (9 + 9 + 7 + 7))
#define USBD_CONFIG_DESCRIPTOR  \
    0x09,         /* bLength | length of descriptor                                             */\
    0x02,         /* bDescriptorType | descriptor type (CONFIGURATION)                          */\
    USBD_CONFIG_DESCRIPTOR_FULL_SIZE, 0x00,    /* wTotalLength | total length of descriptor(s)  */\
    0x01,         /* bNumInterfaces                                                             */\
    0x01,         /* bConfigurationValue                                                        */\
    0x00,         /* index of string Configuration | configuration string index (not supported) */\
    0x80| (((DEVICE_SELF_POWERED) ? 1U:0U)<<6) | (((REMOTE_WU) ? 1U:0U)<<5), /* bmAttributes    */\
    49            /* maximum power in steps of 2mA (98mA)                                       */

#define USBD_INTERFACE0_DESCRIPTOR  \
    0x09,         /* bLength                                                                          */\
    0x04,         /* bDescriptorType | descriptor type (INTERFACE)                                    */\
    0x00,         /* bInterfaceNumber                                                                 */\
    0x00,         /* bAlternateSetting                                                                */\
    0x02,         /* bNumEndpoints | number of endpoints (1)                                          */\
    0x03,         /* bInterfaceClass | interface class (3..defined by USB spec: HID)                  */\
    0x00,         /* bInterfaceSubClass |interface sub-class (0.. no boot interface)                  */\
    0x00,         /* bInterfaceProtocol | interface protocol (1..defined by USB spec: mouse)          */\
    0x00          /* interface string index (not supported)                                           */

/**
 * HID Table must normally be between Interface and EndPoint Descriptor
 * as written in HID spec§7.1 but it doesn't work with OSR2.1
 */
#define USBD_HID0_DESCRIPTOR  \
    0x09,         /* bLength | length of descriptor (9 bytes)                    */\
    0x21,         /* bHIDDescriptor | descriptor type (HID)                      */\
    0x11, 0x01,   /* HID wBcdHID | Spec version 01.11                            */\
    0x00,         /* bCountryCode | HW Target country                            */\
    0x01,         /* bNumDescriptors | Number of HID class descriptors to follow */\
    0x22,         /* bDescriptorType | Report descriptor type is 0x22 (report)   */\
    (uint8_t)(USBD_MOUSE_REPORT_DESCRIPTOR_SIZE),      /* Total length of Report descr., low byte */ \
    (uint8_t)(USBD_MOUSE_REPORT_DESCRIPTOR_SIZE / 256) /* Total length of Report descr., high byte */

#define USBD_ENDPOINT1_DESCRIPTOR  \
    0x07,         /* bLength | length of descriptor (7 bytes)                                     */\
    0x05,         /* bDescriptorType | descriptor type (ENDPOINT)                                 */\
    0x01,         /* bEndpointAddress | endpoint address (IN endpoint, endpoint 1)                */\
    0x03,         /* bmAttributes | endpoint attributes (interrupt)                               */\
    0x40,0x00,    /* bMaxPacketSizeLowByte,bMaxPacketSizeHighByte | maximum packet size (64 bytes) */\
    0x08          /* bInterval | polling interval (10ms)                                          */


#define USBD_ENDPOINT2_DESCRIPTOR  \
    0x07,         /* bLength | length of descriptor (7 bytes)                                     */\
    0x05,         /* bDescriptorType | descriptor type (ENDPOINT)                                 */\
    0x81,         /* bEndpointAddress | endpoint address (IN endpoint, endpoint 1)                */\
    0x03,         /* bmAttributes | endpoint attributes (interrupt)                               */\
    0x40,0x00,    /* bMaxPacketSizeLowByte,bMaxPacketSizeHighByte | maximum packet size (64 bytes) */\
    0x08          /* bInterval | polling interval (10ms)                                          */


/**
 * String config descriptor
 */
#define USBD_STRING_LANG_IX  0x00
#define USBD_STRING_LANG \
    0x04,         /* length of descriptor                   */\
    0x03,         /* descriptor type                        */\
    0x09,         /*                                        */\
    0x04          /* Supported LangID = 0x0409 (US-English) */

#define USBD_STRING_MANUFACTURER_IX  0x01
#define USBD_STRING_MANUFACTURER \
    16,           /* length of descriptor (? bytes)   */\
    0x03,         /* descriptor type                  */\
    'N', 0x00,    /* Define Unicode String "Nordic Semiconductor  */\
    'e', 0x00, \
    'e', 0x00, \
    'd', 0x00, \
    'a', 0x00, \
    ' ', 0x00, \
    'N', 0x00,

#define USBD_STRING_PRODUCT_IX  0x02
#define USBD_STRING_PRODUCT \
    24,           /* length of descriptor (? bytes)         */\
    0x03,         /* descriptor type                        */\
    'F', 0x00,    /* generic unicode string for all devices */\
    'I', 0x00, \
    'D', 0x00, \
    'O', 0x00, \
    '2', 0x00, \
    ' ', 0x00, \
    'T', 0x00, \
    'o', 0x00, \
    'k', 0x00, \
    'e', 0x00, \
    'n', 0x00, \


#define USBD_STRING_SERIAL_IX  0x00

#define USBD_MOUSE_REPORT_DESCRIPTOR_SIZE  34
#define USBD_MOUSE_REPORT_DESCRIPTOR \
    0x06, 0xd0, 0xf1,     /* usage page (FIDO alliance). Global item, applies to all subsequent items  */\
    0x09, 0x01,     /* usage (CTAPHID). Local item                                               */\
    0xA1, 0x01,     /* collection (application)                                                  */\
    0x09, 0x20,     /* usage (FIDO_USAGE_DATA_IN)                                                */\
    0x15, 0x00,     /*   logical minimum (0)                                                     */\
    0x26, 0xFF, 0x00,/*   logical maximum (255)                                                  */\
    0x75, 0x08,     /*   report size (8)                                                         */\
    0x95, 0x40,     /*   report count (64)                                                       */\
    0x81, 0x02,     /*   HID_Input (HID_Data | HID_Absolute | HID_Variable)                      */\
    0x09, 0x21,     /* usage (FIDO_USAGE_DATA_OUT)                                               */\
    0x15, 0x00,     /*   logical minimum (0)                                                     */\
    0x26, 0xFF, 0x00,/*   logical maximum (255)                                                  */\
    0x75, 0x08,     /*   report size (8)                                                         */\
    0x95, 0x40,     /*   report count (64)                                                       */\
    0x91, 0x02,     /*   HID_Output (HID_Data | HID_Absolute | HID_Variable)                     */\
    0xC0            /* End Collection                                                            */


